#В матрице А размером 5 × 5 поменять местами 4-й столбец со столбцом, содержащим максимальный элемент на диагонали.
A=[[1, 25, 44, 31, 7],
   [4, 31, 9, 71, 56],
   [6, 45, 82, 70, 33],
   [4, 87, 36, 28, 9],
   [20, 49, 51, 26, 65]]
f=0
l=0
l=A[0][0]
B=[[1, 25, 44, 31, 7],
   [4, 31, 9, 71, 56],
   [6, 45, 82, 70, 33],
   [4, 87, 36, 28, 9],
   [20, 49, 51, 26, 65]]
for i in range(len(A)):
    if A[i][i] > l:
        l=A[i][i]
        f = i
for k in range(0, 5):
    B[k][3]=A[k][f]
    B[k][f]=A[k][3]
print(B)
