# В матрице размером 5 × 7 переставить столбцы таким образом, чтобы количества отрицательных элементов в столбцах следовали в
#порядке возрастания.
A = [
[2, -45, -67, -17, 93],
[-45, 29, 61, 33, -80],
[-22, -89, 19, -26, -31],
[77, 53, -85, 20, 11],
[-1, -2, -3, -4, -5],
[1, 1, 1, 1, 1],
[100, -100, 100, 100, 100]
]
for i in range (0, 7):
    for j in range(0, 5):
        if A[i][j] == max (A[i]):
            if j>0 and j<4:
                if A[i][j-1]> A[i][j+1]:
                    A[i][j+1]=2*A[i][j+1]
                elif A[i][j-1]< A[i][j+1]:
                    A[i][j-1]=2*A[i][j-1]
            elif j==0:
                A[i][j+1]=2*A[i][j+1]
            elif j==4:
                A[i][j-1]=2*A[i][j-1]
print(A)
